[
  {
    "title": "The Momentous Three - Vegan",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Thrive-Asset_Vegan-Omega-3-Front_2000x2000_071720251.png?v=1754363277",
    "link": "https://www.livemomentous.com/products/the-momentous-three-vegan",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.881Z",
    "handle": "the-momentous-three-vegan",
    "fullDescription": "",
    "ingredients": "",
    "benefits": "Daily Performance for Life essentials: Protein, Creatine, and Omega-3\n            \n            \n                Your daily foundational nutrients, in vegan formulas developed to meet The Momentous Standard™ of quality, efficacy, and transparency.\n            \n        \n    \n    \n        \n\n                \n                \n                    Benefits\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        We never stop pursuing the best. It’s why we developed The Momentous Three™—Protein, Creatine, and Omega-3—the nutrients our expert ecosystem identified as daily non-negotiables and the biggest impact drivers for performance, longevity, and overall health. The Momentous Three - Vegan comprises three daily essentials that are difficult to get from plant-based diets alone.Complete support on a cellular levelWhen taken daily, these 3 nutrients support muscle performance, daily energy, and cognitive function, setting you up for peak performance. 100% Plant Protein: Supports muscle growth, strength, and recovery, as well as immune function and tissue health.Creatine: Widely clinically-studied for improving muscle strength, power output, cognitive performance, and cellular energy production—not just for athletes, but for everyday high performers. Vegan Omega-3: Delivers essential fatty acids to support optimal brain and cardiovascular health as well as muscle and joint recovery.Held to The Momentous Standard™Everything you need, nothing you don’t. We formulate to the highest standards possible, meaning no sucralose, gums, fillers, stabilizers, or artificial ingredients of any kind—ever. We work with the sharpest minds in human performance to develop our products, and ensure every batch is NSF Certified for Sport® to meet the standards demanded by professional sports teams and Olympic committees.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Function\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        100% Plant Protein:Fundamental Macronutrient: A building block of muscle, enzymes, hormones, and neurotransmittersTissue Repair: Supports repair and growth of muscles, organs, and skinMetabolic Function: Key for enzyme activity, hormone balance, cell signaling, and immune defenseEnergy & Wellness: Contributes to daily energy and supports overall health and well-beingCreatine:Power Output & Endurance: Creatine plays a vital role in cellular energy production by increasing the body’s phosphate reservoirs and supporting production of ATP (adenosine triphosphate)—your body’s primary energy currency. During high-intensity activities, ATP is depleted; creatine helps to regenerate it more efficiently, boosting muscle strength, stamina, and performance.Muscle Growth & Recovery: When combined with resistance training, it promotes lean mass by stimulating muscle protein synthesis and reducing inflammation and oxidative stress.Cognitive Function: Improves brain energy utilization, memory, and focus—especially under physical or mental stress.Healthy Aging & Metabolic Function: Supports mitochondrial health, helps prevent muscle loss when combined with resistance training, and may enhance glucose regulation through improved cellular uptake.Vegan Omega-3:Cardiovascular Health: Helps support blood pressure by managing triglyceride levels; helps reduce plaque buildup and supports healthy heart rhythmsBrain Health + Cognitive Support: DHA makes up 10–20% of brain fats, crucial for memory, focus, and mental sharpnessInflammation + Joint Health: EPA delivers anti-inflammatory benefits, easing joint stiffness and discomfortPremier Sourcing: Algal Oil provides direct & critical fatty acids EPA + DHA, unlike seed-based ALA which converts poorly\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    How To Use\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        100% Plant Protein: Mix 1 scoop with 12-14 fl oz of liquid, adjusting the amount to suit your individual daily protein needs.Creatine Monohydrate: Mix 1 scoop in 6-8 oz. of liquid, adjusting the amount to suit your individual creatine needs. Consume within 30 minutes of hydration for optimal absorption. Omega-3: Take 2 capsules with food daily. Refrigerate after opening.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Ingredients\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        100% Plant Protein:Chocolate: PURIS® Pea Protein, Organic Brown RiceOther Ingredients: Cocoa, Organic Cane Sugar, Natural Flavors, Salt, Stevia, Monk Fruit Extract Vanilla Spice: PURIS® Pea Protein, Organic Brown RiceOther Ingredients: Natural Flavors, Organic Cane Sugar, Spice Blend (Cinnamon Bark Powder, Ginger Root Powder, Anise Seed Powder, Black Pepper Powder), Salt, SteviaCreatine: Creapure® Creatine MonohydrateMomentous Creatine is sourced from Creapure®, the purest form of creatine monohydrate available and widely considered to be the gold standard of creatine. While the majority of creatine on the market is sourced from China, ours is a single-sourced ingredient from Germany with no additives, sweeteners, or other ingredients.Vegan Omega-3: Omega-3 Fatty Acids from Algae oil (Schizochytrium sp.): EPA 500mg, DHA 500mgOther Ingredients:Hypromellose (Capsule), Antioxidants (Natural Mixed Tocopherols, Rosemary Extract, Ascorbyl Palmitate), Candelilla WaxMomentous Vegan Omega-3 provides the critical fatty acids EPA + DHA directly from Algal Oil sourced in the USA, EU, and UK.Unlike most plant-based omega-3 formulas that rely on ALA from seeds (which converts poorly to EPA/DHA), ours ensures you get effective doses to support cardiovascular, brain, joint, and muscle health.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Onset Time & Expected Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Take Protein, Creatine, and Omega-3 daily for best results, adjusting dosage as needed to hit your individual goals. Results vary depending on individual, but with consistent use you can expect increased muscle strength and power, improved recovery, reduced inflammation, and enhanced cardiovascular health and cognitive function.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Clinical Research\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                        \n\n\n                    \n                    \n                        There are 15 credible reviews and studies related to this product:100% Plant Protein:Pea proteins oral supplementation promotes muscle thickness gains during resistance training: a double-blind, randomized, Placebo-controlled clinical trial vs. Whey proteinThe Effects of Whey vs. Pea Protein on Physical Adaptations Following 8-Weeks of High-Intensity Functional Training (HIFT): A Pilot StudyEffects of daily 24-gram doses of rice or whey protein on resistance training adaptations in trained malesThe effects of 8 weeks of whey or rice protein supplementation on body composition and exercise performanceCreatine:Beyond muscle: The effects of creatine supplementation on brain creatine, cognitive processing, and traumatic brain injuryCreatine in Health and Disease International Society of Sports Nutrition position stand: safety and efficacy of creatine supplementation in exercise, sport, and medicineCreatine Supplementation and Brain HealthCreatine Supplementation in Women's Health: A Lifespan PerspectiveUse of creatine in the elderly and evidence for effects on cognitive function in young and oldVegan Omega-3:Bioavailability and conversion of plant based sources of omega-3 fatty acids – a scoping review to update supplementation options for vegetarians and vegansBlood docosahexaenoic acid and eicosapentaenoic acid in vegans: Associations with age and gender and effects of an algal-derived omega-3 fatty acid supplementOmega−3 Polyunsaturated Fatty Acids (PUFAs): Emerging Plant and Microbial Sources, Oxidative Stability, Bioavailability, and Health Benefits—A ReviewErythrocyte long-chain omega-3 fatty acid levels are inversely associated with mortality and with incident cardiovascular disease: The Framingham Heart StudyOmega-3 Fatty Acid Supplementation on Post-Exercise Inflammation, Muscle Damage, Oxidative Response, and Sports Performance in Physically Healthy Adults—A Systematic Review of Randomized Controlled Trials",
    "usage": "",
    "category": "",
    "rating": "",
    "reviews_count": "",
    "availability": "",
    "variants": [
      {
        "id": 45142273458359,
        "title": "Chocolate",
        "price": "$110.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Chocolate",
        "option2": null,
        "option3": null,
        "sku": "TM3VEGANCHOC",
        "inventory_quantity": 60
      },
      {
        "id": 45142273491127,
        "title": "Vanilla Spice",
        "price": "$110.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Vanilla Spice",
        "option2": null,
        "option3": null,
        "sku": "TM3VEGANVANSP",
        "inventory_quantity": 60
      }
    ],
    "subscriptionPrice": null,
    "originalPrice": null,
    "images": [],
    "vendor": "Momentous",
    "productType": "Product",
    "tags": [],
    "tagsString": ""
  },
  {
    "title": "Creatine",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Creatine-90_2000x2000_FEB142025_CC_4.png?v=1755187968",
    "link": "https://www.livemomentous.com/products/creatine-monohydrate",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.881Z",
    "handle": "creatine-monohydrate",
    "fullDescription": "",
    "ingredients": "",
    "benefits": "Pure creatine monohydrate held to the highest standards\n            \n            \n                Our Creapure® Creatine is single-sourced from Germany and every batch is NSF Certified for Sport® so you can train with confidence knowing your brain + body are getting the best.\n            \n        \n    \n    \n        \n\n                \n                \n                    Benefits\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Supports daily muscle performance and cognitive function:Power Output & Endurance: By rapidly regenerating ATP, creatine boosts muscle strength, stamina, and performance.Muscle Growth & Recovery: When combined with resistance training, it promotes lean mass by stimulating muscle protein synthesis and reducing inflammation and oxidative stress.Cognitive Function: Improves brain energy utilization, memory, and focus—especially under physical or mental stress.Healthy Aging & Metabolic Function: Supports mitochondrial health, helps prevent muscle loss when combined with resistance training, and may enhance glucose regulation through improved cellular uptake.With consistent use, creatine supplementation can boost your overall energy levels and help decrease recovery time.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Function\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Creatine is a naturally occurring amino acid stored in muscles and the brain, where it plays a vital role in cellular energy production by increasing the body’s phosphate reservoirs and supporting production of ATP (adenosine triphosphate)—your body’s primary energy currency. During high-intensity activities, ATP is rapidly depleted; creatine helps regenerate it more efficiently, enabling you to push harder, recover faster, and perform better across repeated bouts of exertion.In the brain, creatine supports neuronal energy metabolism, contributing to improved memory, focus, processing speed, and overall cognitive resilience. Emerging research even links consistent creatine supplementation to neuroprotective effects, potentially offering support in age-related neurological decline.Momentous Creatine is made with Creapure®—the purest form of creatine monohydrate available, verified for safety and efficacy. It’s NSF Certified for Sport®, making it trusted by elite athletes and everyday high performers.While creatine is present in small amounts in animal-based foods like beef and fish, supplementation remains the most effective way of hitting the recommended daily intake—especially for those following plant-based diets or with higher physical demands.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    How to use\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Mix 1 scoop with 6-8 oz. of water and consume within 30 minutes for maximum benefit—sitting in liquid longer than that will cause creatine to lose its efficacy. \n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Ingredients\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Creatine: Creapure® Creatine MonohydrateMomentous Creatine is sourced from Creapure®, the purest form of creatine monohydrate available and widely considered to be the gold standard of creatine. While the majority of creatine on the market is sourced from China, ours is a single-sourced ingredient from Germany with no additives, sweeteners, or other ingredients.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Clinical Research & 3rd Party Test Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                        \n    \n  \n\n\n\n                    \n                    \n                        There are 6 credible reviews and studies related to this product:1. Beyond muscle: The effects of creatine supplementation on brain creatine, cognitive processing, and traumatic brain injury2. Creatine in Health and Disease3. International Society of Sports Nutrition position stand: safety and efficacy of creatine supplementation in exercise, sport, and medicine4. Creatine Supplementation and Brain Health5. Creatine Supplementation in Women's Health: A Lifespan Perspective6. Use of creatine in the elderly and evidence for effects on cognitive function in young and old",
    "usage": "",
    "category": "",
    "rating": "",
    "reviews_count": "",
    "availability": "",
    "variants": [
      {
        "id": 41634821079223,
        "title": "Default Title",
        "price": "$34.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Default Title",
        "option2": null,
        "option3": null,
        "sku": "850243008796",
        "inventory_quantity": 60
      }
    ],
    "subscriptionPrice": null,
    "originalPrice": null,
    "images": [],
    "vendor": "Momentous",
    "productType": "Product",
    "tags": [],
    "tagsString": ""
  },
  {
    "title": "Creatine 15-Travel Packs",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3-Creatine-Lemon-Carton_2000x2000_03242025-CC_1.png?v=1752077948",
    "link": "https://www.livemomentous.com/products/creatine-15-travel-packs",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.882Z",
    "handle": "creatine-15-travel-packs",
    "fullDescription": "",
    "ingredients": "",
    "benefits": "High-quality Creatine meets anytime, anywhere convenience\n            \n            \n                Our gold standard Creapure® Creatine, in conveniently dosed single-serve packs so you never have to miss a day.\n            \n        \n    \n    \n        \n\n                \n                \n                    Benefits\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Supports daily muscle performance and cognitive function on-the-go:Power Output & Endurance: By rapidly regenerating ATP, creatine boosts muscle strength, stamina, and performance.Muscle Growth & Recovery: When combined with resistance training, it promotes lean mass by stimulating muscle protein synthesis and reducing inflammation and oxidative stress.Cognitive Function: Improves brain energy utilization, memory, and focus—especially under physical or mental stress.Healthy Aging & Metabolic Function: Supports mitochondrial health, helps prevent muscle loss when combined with resistance training, and may enhance glucose regulation through improved cellular uptake.With consistent use, creatine supplementation can boost your overall energy levels and help decrease recovery time.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Function\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Creatine is a naturally occurring amino acid stored in muscles and the brain, where it plays a vital role in cellular energy production by increasing the body’s phosphate reservoirs and supporting production of ATP (adenosine triphosphate)—your body’s primary energy currency. During high-intensity activities, ATP is rapidly depleted; creatine helps regenerate it more efficiently, enabling you to push harder, recover faster, and perform better across repeated bouts of exertion.In the brain, creatine supports neuronal energy metabolism, contributing to improved memory, focus, processing speed, and overall cognitive resilience. Emerging research even links consistent creatine supplementation to neuroprotective effects, potentially offering support in age-related neurological decline.Momentous Creatine is made with Creapure®—the purest form of creatine monohydrate available, verified for safety and efficacy. It’s NSF Certified for Sport®, making it trusted by elite athletes and everyday high performers.While creatine is present in small amounts in animal-based foods like beef and fish, supplementation remains the most effective way of hitting the recommended daily intake—especially for those following plant-based diets or with higher physical demands.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    How To Use\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Mix 1 packet with 6-8 oz. of water and consume within 30 minutes for maximum benefit—sitting in liquid longer than that will cause creatine to lose its efficacy. \n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Ingredients\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                         UnflavoredCreatine: Creapure® Creatine Monohydrate 5gLemonCreatine: Creapure® Creatine Monohydrate 5gOther Ingredients: Citric Acid, Natural Lemon Flavor, SteviaMomentous Creatine is sourced from Creapure®, the purest form of creatine monohydrate available and widely considered to be the gold standard of creatine. While the majority of creatine on the market is sourced from China, ours is a single-sourced ingredient from Germany with no additives, sweeteners, or other ingredients.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Clinical Research & 3rd Party Test Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                        \n    \n  \n\n\n\n                    \n                    \n                        There are 6 credible reviews and studies related to this product:1. Beyond muscle: The effects of creatine supplementation on brain creatine, cognitive processing, and traumatic brain injury2. Creatine in Health and Disease3. International Society of Sports Nutrition position stand: safety and efficacy of creatine supplementation in exercise, sport, and medicine4. Creatine Supplementation and Brain Health5. Creatine Supplementation in Women's Health: A Lifespan Perspective6. Use of creatine in the elderly and evidence for effects on cognitive function in young and old",
    "usage": "",
    "category": "",
    "rating": "",
    "reviews_count": "",
    "availability": "",
    "variants": [
      {
        "id": 44831961153719,
        "title": "Lemon",
        "price": "$19.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Lemon",
        "option2": null,
        "option3": null,
        "sku": "850030796899",
        "inventory_quantity": 60
      },
      {
        "id": 44831961120951,
        "title": "Unflavored",
        "price": "$19.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Unflavored",
        "option2": null,
        "option3": null,
        "sku": "850030796387",
        "inventory_quantity": 60
      }
    ],
    "subscriptionPrice": null,
    "originalPrice": null,
    "images": [],
    "vendor": "Momentous",
    "productType": "Product",
    "tags": [],
    "tagsString": ""
  },
  {
    "title": "Grass-Fed Whey Protein Isolate Powder",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Chocolate-Whey-Jar_2000x2000_FEB142025_CC.png?v=1739922071",
    "link": "https://www.livemomentous.com/products/essential-whey-protein",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.882Z",
    "handle": "essential-whey-protein",
    "fullDescription": "",
    "ingredients": "",
    "benefits": "High quality grass-fed whey, optimized for max absorption + easy digestion.\n            \n            \n                Made with only the essentials—no fillers, gums, or artificial sweeteners—our whey isolate meets The Momentous Standard™ in formula cleanliness, efficacy, and testing. It’s essential for everyone, every day.\n            \n        \n    \n    \n        \n\n                \n                \n                    Benefits\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Momentous Whey Protein Isolate delivers 20g of grass-fed protein per serving to support muscle growth, recovery, and daily wellness. Sourced from European dairy farms held to rigorous standards, and cold-processed to preserve its amino acid profile, it’s designed for maximum absorption and minimal GI discomfort. Enhanced with ProHydrolase® enzymes and NSF Certified for Sport®, this clean, high-performance formula is trusted by elite athletes and everyday high-performers.Supports lean muscle mass and strengthAccelerates recovery when taken post-exercisePromotes immune health and overall well-beingWith ProHydrolase® for superior absorption and easy digestionFree from artificial ingredients, sweeteners, and fillers\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Function\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Momentous Whey Protein Isolate is a high-quality, grass-fed whey protein designed for optimal performance, recovery, and daily muscle maintenance. Each serving delivers 20g of complete protein sourced from European dairy farms held to rigorous standards—meaning no hormones, steroids, or rBST. Ours is superior in that it’s cold-processed and micro-filtered, preserving the integrity of its amino acid profile while minimizing sugar, fat, and lactose.What sets our formula apart is the inclusion of ProHydrolase®, a clinically researched enzyme that enhances protein breakdown and amino acid uptake. This not only improves digestion and reduces the risk of GI discomfort, but also ensures that your body efficiently absorbs and utilizes the protein for maximum results.Whey isolate is known for its fast absorption—ideal for the post-workout window, when your muscles are most receptive to nutrients. It contains high levels of leucine, a key amino acid that directly stimulates muscle protein synthesis, making it a powerful tool for strength development and recovery.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    How To Use\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        1 scoop with 10-12 fluid ounces of preferred liquid, as needed, to reach optimal daily protein intake.The latest research suggests consuming 0.8 to 1.2 grams of protein per pound of body weight daily, depending on your fitness goals and activity level.Part of The Momentous Three, along with Creatine and Omega-3, as a daily essential for foundational health.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Ingredients\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Chocolate: grass-fed whey protein isolate, ProHydrolase®, natural flavors, cocoa, salt, monk fruit extract, steviaVanilla: grass-fed whey protein isolate, ProHydrolase®, natural flavors, salt, monk fruit extract, steviaUnflavored: grass-fed whey protein isolate, ProHydrolase®Strawberry: grass-fed whey protein isolate, ProHydrolase®, natural strawberry flavor, Reb M*, beet root/carrot juice powder (for color)ProHydrolase® is a clinically researched enzyme that enhances protein breakdown and amino acid uptake.*Reb M is a natural, plant-based sweetener with zero glycemic response or aftertaste. 250× sweeter than sugar without bloating, 2.5× sweeter than monk fruit, and made sustainably with less land, water, and crop rotation.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Onset Time & Expected Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Use daily, as needed to hit your individual protein goals. A general guideline many experts suggest is 0.8 to 1.2 grams of protein per pound of body weight (about 1.6 to 2.7 grams per kilogram) each day. Competitive athletes, people with intense training schedules, or those aiming to build significant muscle may benefit from the higher end of that rangeEstimated 4-6 weeks of supplementation for noticeable improvements in strength and performance, with consistent intake and resistance training. Long-term benefits are best achieved with consistent daily use.Results vary depending on a host of individual factors including diet and lifestyle, but may include increased strength and stamina, reduced recovery time, and improved overall wellbeing\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Clinical Research & 3rd Party Test Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                        \n    \n  \n\n\n\n                    \n                    \n                        There are 4 credible reviews and studies related to this product:The Effect of ProHydrolase® on the Amino Acid and Intramuscular Anabolic Signaling Response to Resistance Exercise in Trained MalesEffects of whey protein supplementation prior to, and following, resistance exercise on body composition and training responses: A randomized double-blind placebo-controlled studyWhey protein isolate attenuates strength decline after eccentrically-induced muscle damage in healthy individualsEffect of timing of whey protein supplement on muscle damage markers after eccentric exercise",
    "usage": "",
    "category": "",
    "rating": "",
    "reviews_count": "",
    "availability": "",
    "variants": [
      {
        "id": 40138095689911,
        "title": "Chocolate",
        "price": "$47.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Chocolate",
        "option2": null,
        "option3": null,
        "sku": "850243008949",
        "inventory_quantity": 60
      },
      {
        "id": 40138095722679,
        "title": "Vanilla",
        "price": "$47.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Vanilla",
        "option2": null,
        "option3": null,
        "sku": "850243008932",
        "inventory_quantity": 60
      },
      {
        "id": 43277469548727,
        "title": "Unflavored",
        "price": "$47.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Unflavored",
        "option2": null,
        "option3": null,
        "sku": "850030796134",
        "inventory_quantity": 60
      },
      {
        "id": 45191939096759,
        "title": "Strawberry",
        "price": "$47.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Strawberry",
        "option2": null,
        "option3": null,
        "sku": "850072768106",
        "inventory_quantity": 60
      }
    ],
    "subscriptionPrice": null,
    "originalPrice": null,
    "images": [],
    "vendor": "Momentous",
    "productType": "Product",
    "tags": [],
    "tagsString": ""
  },
  {
    "title": "100% Plant Protein Powder - Limited Edition Flavor",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/2_103286c8-2420-470f-9bac-d94e29bd5bf9.png?v=1753223694",
    "link": "https://www.livemomentous.com/products/100-plant-protein-powder-limited-edition-flavor",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.882Z",
    "handle": "100-plant-protein-powder-limited-edition-flavor",
    "fullDescription": "",
    "ingredients": "",
    "benefits": "20g Plant Protein with a complete amino acid profile\n            \n            \n                NSF Certified for Sport®, free from artificial ingredients, and made with pea and rice proteins sourced from the U.S. and Canada.\n            \n        \n    \n    \n        \n\n                \n                \n                    Benefits\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Momentous 100% Plant Protein is built for high performers who demand the best from their nutrition. With 20g of clean, plant-based protein per serving, using pea + rice proteins sourced exclusively from the U.S. & Canada, it provides a complete amino acid profile to fuel recovery and optimize performance. NSF Certified for Sport® for purity and safety, this protein is free from artificial additives and low in sugar, ensuring a smooth, incredible-tasting experience every time.Smooth Texture and Taste: Smooth taste, no grit, no chalkiness, and easy mixing to fit seamlessly into your routine.Complete Amino Acid Profile: Combines pea and rice proteins to maximize muscle recovery and support strength gains.Clean Nutrition: Free from gums, fillers, and stabilizers. No artificial ingredients, and only 2 grams of organic cane sugar.Certified for Champions: Every batch is NSF Certified for Sport®, tested for heavy metals, harmful additives, and label claim accuracy, to meet pro sports + Olympic-level standards.Vegan and Allergen-Free: Built for all diets, without soy or common allergens.Supports muscle mass and strength: Essential for building and repairing muscle tissues\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Function\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        Protein is a fundamental macronutrient that is a building block of muscle tissue, enzymes, hormones, and neurotransmitters.Builds and repairs tissues, including muscles, organs, and skin.Plays a key role in enzyme production, facilitating chemical reactions in the body, and is involved in hormone production, cell signaling, and immune system function.Provides energy and helps to aid overall health and well-being.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    How To Use\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        1 scoop with 12-14 fluid ounces of preferred liquid, as needed, to reach optimal daily protein intake.The latest research suggests consuming 0.8 to 1.2 grams of protein per pound of body weight daily, depending on your fitness goals and activity level.Part of The Momentous Three™, along with Creatine and Omega-3, as a daily essential for foundational health.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Ingredients\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        PURIS® pea protein, Organic brown rice protein, Organic Cane Sugar, Natural Flavors, Decaffeinated Mexican Coffee Powder, Reb MReb M is a naturally occurring compound found in the leaves of the Stevia plant\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Onset Time & Expected Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                    \n                        While results vary based on individual factors, you may begin noticing improvements in recovery, energy levels, and overall performance within days of regular use as part of your daily routine.What to Expect:Immediate: Provides a quick, convenient source of protein to refuel muscles after workouts.Short-Term: Supports muscle repair and reduces soreness within days of consistent use.Long-Term: Helps build strength and endurance over weeks, optimizing recovery and overall performance.\n                    \n                \n                \n            \n            \n         \n\n                \n                \n                    Clinical Research & 3rd Party Test Results\n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                    \n                        \n\n        \n            \n        \n    \n\n                    \n                \n                \n                \n                \n                \n                    \n                        \n    \n  \n\n\n\n                    \n                    \n                        There are 4 credible reviews and studies related to this product:Pea proteins oral supplementation promotes muscle thickness gains during resistance training: a double-blind, randomized, Placebo-controlled clinical trial vs. Whey proteinThe Effects of Whey vs. Pea Protein on Physical Adaptations Following 8-Weeks of High-Intensity Functional Training (HIFT): A Pilot StudyEffects of daily 24-gram doses of rice or whey protein on resistance training adaptations in trained malesThe effects of 8 weeks of whey or rice protein supplementation on body composition and exercise performance",
    "usage": "",
    "category": "",
    "rating": "",
    "reviews_count": "",
    "availability": "",
    "variants": [
      {
        "id": 45036544262327,
        "title": "Cappuccino",
        "price": "$34.95",
        "compareAtPrice": null,
        "available": true,
        "option1": "Cappuccino",
        "option2": null,
        "option3": null,
        "sku": "850030796783",
        "inventory_quantity": 60
      }
    ],
    "subscriptionPrice": null,
    "originalPrice": null,
    "images": [],
    "vendor": "Momentous",
    "productType": "Product",
    "tags": [],
    "tagsString": ""
  },
  {
    "title": "Vegan Omega-3",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Vegan-Omega-3_2000x2000_05112025_FINAL.png?v=1752865918",
    "link": "https://www.livemomentous.com/products/vegan-omega-3",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.882Z"
  },
  {
    "title": "Omega-3",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V1_Omega-3-Bottle_2000x2000_FEB142025_CC.png?v=1740008075",
    "link": "https://www.livemomentous.com/products/omega-3",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.882Z"
  },
  {
    "title": "Magnesium L-Threonate",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Magnesium-L-Threonate-Bottle_2000x2000_07142025.png?v=1757606826",
    "link": "https://www.livemomentous.com/products/magnesium-threonate",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "Collagen Peptides",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Collagen-Peptides-Jar_2000x2000_FEB142025_CC.png?v=1739911430",
    "link": "https://www.livemomentous.com/products/collagen-peptides",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "The Women’s Three",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/The-Women_s-Line_2000x2000_06022025.png?v=1748889634",
    "link": "https://www.livemomentous.com/products/the-womens-three",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "Male Hormone Support Stack",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Male-Hormone-Support-Stack_2000x2000_FEB212025_CC_1.png?v=1742236628",
    "link": "https://www.livemomentous.com/products/hormone-support-stack",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "Tongkat Ali",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Tongkat-Ali-Bottle_2000x2000_FEB142025_CC.png?v=1739920875",
    "link": "https://www.livemomentous.com/products/tongkat",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "Vitamin D3 5000 IU",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Vitamin-D3-5000iU-Bottle_2000x2000_02142025_FINAL-CC.png?v=1739921790",
    "link": "https://www.livemomentous.com/products/vitamin-d3-5000-iu",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.883Z"
  },
  {
    "title": "Multivitamin",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V2_Essential-Multi-Bottle_2000x2000_02142025-CC.png?v=1739914444",
    "link": "https://www.livemomentous.com/products/essential-multivitamin",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Sleep",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Sleep-With-Pouch_2000x2000_FEB212025_CC.png?v=1740586310",
    "link": "https://www.livemomentous.com/products/sleep-pack",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Apigenin",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Apigenin-Bottle_2000x2000_11072024-CC.png?v=1739910765",
    "link": "https://www.livemomentous.com/products/apigenin",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "L-Theanine",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_L-Theanine-Bottle_2000x2000_02142025.png?v=1739914167",
    "link": "https://www.livemomentous.com/products/l-theanine",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Alpha GPC",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Alpha-GPC-Bottle_2000x2000_02142025-CC.png?v=1739910549",
    "link": "https://www.livemomentous.com/products/alpha-gpc",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Complete Sleep Stack",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Complete-Sleep-Stack_2000x2000_FEB212025_CC_1.png?v=1742235858",
    "link": "https://www.livemomentous.com/products/huberman-sleep-stack",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Rhodiola Rosea",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Rhodiola-Bottle_2000x2000_02142025-CC.png?v=1739922761",
    "link": "https://www.livemomentous.com/products/rhodiola-rosea-extract",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.884Z"
  },
  {
    "title": "Vital Aminos",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Vital-Aminos-Fruit-Punch_2000x2000_FEB142025_CC.png?v=1739921622",
    "link": "https://www.livemomentous.com/products/vital-amino",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Zinc",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Zinc-Bottle_2000x2000_02142025-CC.png?v=1739922299",
    "link": "https://www.livemomentous.com/products/zinc-picolinate",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Recovery",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V2_Chocolate-Recovery-Jar_2000x2000_FEB142025_CC.png?v=1739915108",
    "link": "https://www.livemomentous.com/products/recovery-grass-fed-whey-isolate",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Magnesium Malate",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V1_Magnesium-Malate-Bottle_2000x2000_02142025-CC.png?v=1739914381",
    "link": "https://www.livemomentous.com/products/magnesium-malate-1",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Turmeric",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Tumeric_CC.png?v=1739921017",
    "link": "https://www.livemomentous.com/products/turmeric-ultra",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Collagen + Creatine Stack",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Collagen-Creatine-30-Stack_2000x2000_02212025-CC_1.png?v=1742235058",
    "link": "https://www.livemomentous.com/products/collagen-creatine",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Ashwagandha",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V2_Ashwagandha-Bottle_2000x2000_02142025.png?v=1739910970",
    "link": "https://www.livemomentous.com/products/ashwagandha",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.885Z"
  },
  {
    "title": "Acetyl L-Carnitine",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Acetyl-L-Carnitine-Bottle_2000x2000_02142025-CC.png?v=1739910356",
    "link": "https://www.livemomentous.com/products/acetyl-l-carnitine",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "Brain Drive",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Brain-Drive-Bottle_2000x2000_02142025.png?v=1739911197",
    "link": "https://www.livemomentous.com/products/brain-drive",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "100% Plant Protein Powder",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Chocolate-Plant-Protein_Plant-Protein_Jar_2000x2000_FEB142025_CC.png?v=1740008868",
    "link": "https://www.livemomentous.com/products/100-plant-protein-powder",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "Inositol",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Inositol_2000x2000_02142025.png?v=1739913971",
    "link": "https://www.livemomentous.com/products/inositol",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "L-Glutamine",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_L-Glutamine-Jar_2000x2000_FEB142025_CC.png?v=1739914062",
    "link": "https://www.livemomentous.com/products/l-glutamine",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "Tyrosine",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_L-Tyrosine-Bottle_2000x2000_02142024-CC.png?v=1739921477",
    "link": "https://www.livemomentous.com/products/tyrosine",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "Elite Sleep",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Elite-Sleep-Bottle_2000x2000_02142025.png?v=1739913587",
    "link": "https://www.livemomentous.com/products/elite-sleep",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.886Z"
  },
  {
    "title": "Resveratrol",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V3_Reservatrol-Bottle_2000x2000_02142025_1.png?v=1740086081",
    "link": "https://www.livemomentous.com/products/resveratrol-30-serving-jar",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.887Z"
  },
  {
    "title": "PR Lotion® Bottle",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/V1_PR-Lotion_2000x2000__FEB1412025_CC.png?v=1739914729",
    "link": "https://www.livemomentous.com/products/pr-lotion-bottle",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.887Z"
  },
  {
    "title": "Focus & Cognition Stack",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/Focus-Cognition-Stack_2000x2000_FEB212025_CC_1.png?v=1742236233",
    "link": "https://www.livemomentous.com/products/focus-cognition-stack",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.887Z"
  },
  {
    "title": "The Momentous Three",
    "price": "Price not available",
    "image": "https://www.livemomentous.com/cdn/shop/files/TM3-Whey-Chocolate_FEB242025_CC_2.png?v=1742237115",
    "link": "https://www.livemomentous.com/products/the-momentous-three",
    "description": "",
    "scraped_at": "2025-09-12T11:15:24.887Z"
  }
]