[
  {
    "title": "The Momentous Three - Vegan",
    "price": "$1.28",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/Thrive-Asset_Vegan-Omega-3-Front_2000x2000_071720251.png?v=1754363277",
    "link": "https://www.livemomentous.com/products/the-momentous-three-vegan",
    "description": "The Momentous Three™: Protein, Creatine, and Omega-3—the 3 nutrients Momentous’ expert ecosystem identified as daily non-negotiables and the biggest impact drivers for longevity of performance and ove...",
    "fullDescription": "The Momentous Three™: Protein, Creatine, and Omega-3—the 3 nutrients Momentous’ expert ecosystem identified as daily non-negotiables and the biggest impact drivers for longevity of performance and overall health. Each product was developed to meet The Momentous Standard™ of quality, efficacy, and transparency, so you can focus your energy on your goals. Taken daily, this protocol supports muscle strength, growth, and recovery, as well as cognitive function including focus, mental sharpness, and memory recall. \n\nThis Vegan version, including 100% Plant Protein Powder, Creapure Creatine Monohydrate and Vegan Omega-3, makes plant-based nutrition simple, delicious and effective.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "",
    "scraped_at": "2025-09-11T13:45:11.106Z"
  },
  {
    "title": "Creatine",
    "price": "$0.40",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Creatine-90_2000x2000_FEB142025_CC_4.png?v=1755187968",
    "link": "https://www.livemomentous.com/products/creatine-monohydrate",
    "description": "At Momentous, we eliminate all the guesswork by using only Creapure® Creatine, the purest + most potent creatine monohydrate available and considered the gold standard in creatine supplementation. \n\nC...",
    "fullDescription": "At Momentous, we eliminate all the guesswork by using only Creapure® Creatine, the purest + most potent creatine monohydrate available and considered the gold standard in creatine supplementation. \n\nCreatine is an amino acid that plays a critical role in cellular energy production by helping boost phosphate reservoirs and supporting the creation of adenosine triphosphate (ATP) throughout the body. ATP is key to driving energy at the cellular level and supports fundamental functions from muscle movement to nerve cell growth, making creatine a daily non-negotiable.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "90 Day Cycle, athletic performance, boost your performance, Brain Health, cognitive function, foundational health, Huberman, long term cognitive health, strength, Sustained Performance",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Creatine 15-Travel Packs",
    "price": "$0.23",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3-Creatine-Lemon-Carton_2000x2000_03242025-CC_1.png?v=1752077948",
    "link": "https://www.livemomentous.com/products/creatine-15-travel-packs",
    "description": "We’ve made it easier than ever to stay consistent with conveniently dosed single-serve packs, made with the same Creapure® Creatine that makes ours the gold standard in creatine supplementation—now av...",
    "fullDescription": "We’ve made it easier than ever to stay consistent with conveniently dosed single-serve packs, made with the same Creapure® Creatine that makes ours the gold standard in creatine supplementation—now available in naturally-sweetened Lemon flavor. \n\nCreatine is an amino acid that plays a critical role in cellular energy production by helping boost phosphate reservoirs and supporting the creation of adenosine triphosphate (ATP) throughout the body. ATP is key to driving energy at the cellular level and supports fundamental functions from muscle movement to nerve cell growth, making creatine a daily non-negotiable.  ",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "athletic performance, boost your performance, Brain Health, cognitive function, foundational health, long term cognitive health, strength, Sustained Performance",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Grass-Fed Whey Protein Isolate Powder",
    "price": "$0.55",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Chocolate-Whey-Jar_2000x2000_FEB142025_CC.png?v=1739922071",
    "link": "https://www.livemomentous.com/products/essential-whey-protein",
    "description": "Momentous Whey Protein Isolate delivers 20g of high-quality, grass-fed protein per serving to support muscle recovery, performance, and daily nutrition. Sourced from European dairy farms held to rigor...",
    "fullDescription": "Momentous Whey Protein Isolate delivers 20g of high-quality, grass-fed protein per serving to support muscle recovery, performance, and daily nutrition. Sourced from European dairy farms held to rigorous regulatory standards, our whey comes from grass-fed cows free of hormones, steroids, and rBST. Cold-processed and micro-filtered to preserve its full amino acid profile, this protein is designed for superior absorption and minimal GI discomfort. We add ProHydrolase®, a clinically studied enzyme, to further enhance digestion and absorption—so you get the most out of your protein routine. NSF Certified for Sport®, our formula is rigorously tested to meet the highest standards of purity and safety.\n ",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, athletic performance, Huberman, label: New Container, Momentous, Muscle Development, Muscle Growth, protein, recover faster, Recovery, sports nutrition, strength, Subscribe & Save",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "100% Plant Protein Powder - Limited Edition Flavor",
    "price": "$0.40",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/2_103286c8-2420-470f-9bac-d94e29bd5bf9.png?v=1753223694",
    "link": "https://www.livemomentous.com/products/100-plant-protein-powder-limited-edition-flavor",
    "description": "Consistency unlocks results, and variety helps you stay consistent. Our limited-edition Vegan Protein Powder in Cappuccino flavor, features the same clean, effective 100% Plant-Based Protein you trust...",
    "fullDescription": "Consistency unlocks results, and variety helps you stay consistent. Our limited-edition Vegan Protein Powder in Cappuccino flavor, features the same clean, effective 100% Plant-Based Protein you trust. This smooth, coffee-inspired blend delivers a complete amino acid profile from pea and brown rice protein, with no artificial sweeteners, gums, or fillers. With a smooth cappuccino taste, it’s perfect for upgrading your post-workout recovery shake or daily coffee ritual—without compromising on quality.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Vegan Omega-3",
    "price": "$0.53",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/Vegan-Omega-3_2000x2000_05112025_FINAL.png?v=1752865918",
    "link": "https://www.livemomentous.com/products/vegan-omega-3",
    "description": "Momentous Vegan Omega-3 is the most powerful plant-based omega-3 formula available, containing a market-leading 500mg each of EPA + DHA for a total 1,000mg delivery of Omega oil per serving. It’s sour...",
    "fullDescription": "Momentous Vegan Omega-3 is the most powerful plant-based omega-3 formula available, containing a market-leading 500mg each of EPA + DHA for a total 1,000mg delivery of Omega oil per serving. It’s sourced from Algal Oil—the original source of omegas consumed by fish. The result is a formula that provides crucial cell membrane support, contributing to improved brain function, muscle recovery, and overall resilience, in a clean, highly effective capsule that’s 100% free of animal products and unnecessary fillers.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Omega-3",
    "price": "$0.40",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V1_Omega-3-Bottle_2000x2000_FEB142025_CC.png?v=1740008075",
    "link": "https://www.livemomentous.com/products/omega-3",
    "description": "Momentous Omega-3 delivers a clinically effective dose of 1,600mg of EPA and DHA in a clean 1:1 ratio, sustainably sourced from Norway. Designed to support brain function, cardiovascular health, infla...",
    "fullDescription": "Momentous Omega-3 delivers a clinically effective dose of 1,600mg of EPA and DHA in a clean 1:1 ratio, sustainably sourced from Norway. Designed to support brain function, cardiovascular health, inflammation balance, and muscle recovery, this formula is NSF Certified for Sport® and tested for purity and heavy metals.Ideal for daily use, Omega-3 helps optimize performance and long-term health—without the fishy aftertaste. It’s foundational support for anyone training hard, thinking hard, or aging well.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, Brain Health, cognitive function, cognitive performance, Daily Essentials, foundational health, Huberman, inflammation, Joint and Bone Strength, label:best-seller, long term cognitive health, Momentous, Shop All, Subscribe & Save, Supplements, Under 50",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Magnesium L-Threonate",
    "price": "$0.50",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Magnesium-L-Threonate-Bottle_2000x2000_07142025.png?v=1757544487",
    "link": "https://www.livemomentous.com/products/magnesium-threonate",
    "description": "Magnesium L-Threonate is a breakthrough form of magnesium that effectively crosses the blood-brain barrier, making it ideal for cognitive support, sleep quality, and neurological recovery. It has been...",
    "fullDescription": "Magnesium L-Threonate is a breakthrough form of magnesium that effectively crosses the blood-brain barrier, making it ideal for cognitive support, sleep quality, and neurological recovery. It has been shown to increase brain magnesium levels, which are critical for synaptic plasticity, memory formation, and calm brain activity.Magtein®, the patented form of Magnesium L-Threonate used in clinical studies. It’s ideal for individuals looking to improve focus, reduce stress, and support deep, restorative sleep without sedation.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, cognitive performance, Daily Essentials, Huberman, label:new, Momentous, new, quality sleep, Shop All, sleep, Staying Asleep + Sleep Quality, Supplements, Travel + Shift Work",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Collagen Peptides",
    "price": "$0.52",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Collagen-Peptides-Jar_2000x2000_FEB142025_CC.png?v=1739911430",
    "link": "https://www.livemomentous.com/products/collagen-peptides",
    "description": "Momentous Collagen Peptides combine 10g of grass-fed bovine collagen with 5g of FORTIGEL®—a clinically researched form shown to promote collagen synthesis in tendons and ligaments. Enhanced with Vitam...",
    "fullDescription": "Momentous Collagen Peptides combine 10g of grass-fed bovine collagen with 5g of FORTIGEL®—a clinically researched form shown to promote collagen synthesis in tendons and ligaments. Enhanced with Vitamin C to support absorption, this formula helps strengthen joints, improve skin elasticity, and support long-term tissue resilience.Free from fat, sugar, cholesterol, and additives, Collagen Peptides are ideal for athletes and active individuals focused on recovery, mobility, and aging well. Mix it easily into your daily routine to support the structure that powers your movement.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, athletic performance, Collagen, Daily Essentials, foundational health, Huberman, Joint and Bone Strength, joint health, label:best-seller, Momentous, recover faster, Recovery, Soft Tissue Health, sports nutrition, Subscribe & Save, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "The Women’s Three",
    "price": "$0.55",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/The-Women_s-Line_2000x2000_06022025.png?v=1748889634",
    "link": "https://www.livemomentous.com/products/the-womens-three",
    "description": "The Women’s Three is a daily health system comprised of Iron+, Calcium, and Vitamin D3 2000IU and developed in collaboration with renowned expert Dr. Stacy Sims specifically for female biology—with a ...",
    "fullDescription": "The Women’s Three is a daily health system comprised of Iron+, Calcium, and Vitamin D3 2000IU and developed in collaboration with renowned expert Dr. Stacy Sims specifically for female biology—with a targeted AM/PM dosing protocol to maximize absorption in supporting daily energy, maintaining strong, healthy bones, and promoting long-term resilience.\nLIMITED TIME ONLY: NEVER MISS A DAY\nUse our travel case—free with your first TW3 order—to support your routine anywhere and everywhere.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, all, athletic performance, Bone + Joint Health, boost your performance, Daily Essentials, endurance, Endurance & Energy, foundational health, health longevity, Immune Support, Joint and Bone Strength, joint health, Momentous, new, recover faster, Recovery, Shop All, sports nutrition, strength, vitamins, Women, womens health",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Male Hormone Support Stack",
    "price": "$0.58",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/Male-Hormone-Support-Stack_2000x2000_FEB212025_CC_1.png?v=1742236628",
    "link": "https://www.livemomentous.com/products/hormone-support-stack",
    "description": "The Male Hormone Support Stack combines Tongkat Ali and Zinc to naturally support testosterone production, energy levels, and overall male vitality. This stack is designed to help active men maintain ...",
    "fullDescription": "The Male Hormone Support Stack combines Tongkat Ali and Zinc to naturally support testosterone production, energy levels, and overall male vitality. This stack is designed to help active men maintain hormonal balance, improve mood, and enhance strength and performance under physical and mental stress.Tongkat Ali is a traditional herb known to help regulate cortisol and support healthy testosterone levels. Zinc plays a key role in hormone metabolism, immune function, and muscle repair. Together, they offer targeted support for stamina, libido, and male hormonal health.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "75 Day Cycle, Hormone Metabolism, hormone support, Huberman",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Tongkat Ali",
    "price": "$0.20",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Tongkat-Ali-Bottle_2000x2000_FEB142025_CC.png?v=1739920875",
    "link": "https://www.livemomentous.com/products/tongkat",
    "description": "Tongkat Ali, also known as Longjack (Eurycoma longifolia), is a traditional Southeast Asian herb known for its ability to support healthy testosterone levels, boost energy, and improve mood. It’s part...",
    "fullDescription": "Tongkat Ali, also known as Longjack (Eurycoma longifolia), is a traditional Southeast Asian herb known for its ability to support healthy testosterone levels, boost energy, and improve mood. It’s particularly beneficial for men looking to enhance physical performance, muscle growth, and hormonal balance.Tongkat Ali has also been shown to help regulate stress hormones like cortisol, supporting resilience and recovery during periods of high physical or mental demand. It’s an ideal daily supplement for active individuals seeking natural support for stamina, strength, and overall vitality.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "75 Day Cycle, foundational health, Hormone Metabolism, hormone support, Huberman, label:new, Momentous, Shop All, Subscribe & Save, Subscription, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Vitamin D3 5000 IU",
    "price": "$0.17",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Vitamin-D3-5000iU-Bottle_2000x2000_02142025_FINAL-CC.png?v=1739921790",
    "link": "https://www.livemomentous.com/products/vitamin-d3-5000-iu",
    "description": "Vitamin D3 5000 IU is a high-potency supplement designed to help maintain healthy vitamin D levels and support bone strength, immune function, and inflammation balance. This fat-soluble nutrient plays...",
    "fullDescription": "Vitamin D3 5000 IU is a high-potency supplement designed to help maintain healthy vitamin D levels and support bone strength, immune function, and inflammation balance. This fat-soluble nutrient plays a key role in calcium absorption, helping to preserve skeletal health and muscular function—especially important for athletes and individuals with low sun exposure.Sourced from lanolin, our D3 5000 IU is ideal for those needing a stronger daily dose to meet their health and performance goals. It’s a simple but powerful tool for maintaining energy, resilience, and recovery.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, Amp Human, Bone + Joint Health, Daily Essentials, foundational health, hormone support, Huberman, Immune Support, inflammation, Joint and Bone Strength, joint health, marketing samples, Momentous, Supplements, vitamins, Wholesale Store",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Multivitamin",
    "price": "$0.55",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V2_Essential-Multi-Bottle_2000x2000_02142025-CC.png?v=1739914444",
    "link": "https://www.livemomentous.com/products/essential-multivitamin",
    "description": "The Momentous Multivitamin is a comprehensive blend of essential vitamins, minerals, and phytonutrients designed to fill common dietary gaps and support overall health, energy, and immune function. So...",
    "fullDescription": "The Momentous Multivitamin is a comprehensive blend of essential vitamins, minerals, and phytonutrients designed to fill common dietary gaps and support overall health, energy, and immune function. Sourced from bioavailable forms and modeled after nutrient-dense whole foods, it delivers what your body needs without unnecessary fillers or megadosing.Whether you’re an athlete pushing physical limits or simply looking for balanced daily support, this formula provides the critical micronutrients that fuel cellular function, metabolism, and long-term well-being.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, Daily Essentials, foundational health, hormone support, Momentous, Stocking Stuffers, Subscribe & Save, Supplements, vitamins",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Sleep",
    "price": "$1.24",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Sleep-With-Pouch_2000x2000_FEB212025_CC.png?v=1740586310",
    "link": "https://www.livemomentous.com/products/sleep-pack",
    "description": "The Sleep 30-Pack delivers a full month of melatonin-free, research-backed sleep support with a calming blend of Magnesium L-Threonate, Apigenin, and L-Theanine. Together, these ingredients help ease ...",
    "fullDescription": "The Sleep 30-Pack delivers a full month of melatonin-free, research-backed sleep support with a calming blend of Magnesium L-Threonate, Apigenin, and L-Theanine. Together, these ingredients help ease the body and mind into a restful state, reduce nighttime wakeups, and promote deeper, higher-quality sleep.Ideal for anyone seeking consistent, restorative rest without the use of melatonin, this formula supports the natural sleep-wake cycle, reduces stress, and helps you wake up feeling refreshed and mentally clear.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, Falling Asleep, Huberman, Shop All, sleep, Staying Asleep + Sleep Quality, Supplements, travel, Travel + Shift Work",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Apigenin",
    "price": "$0.23",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Apigenin-Bottle_2000x2000_11072024-CC.png?v=1739910765",
    "link": "https://www.livemomentous.com/products/apigenin",
    "description": "Apigenin is a naturally occurring flavonoid found in chamomile and other plants, known for its calming effects on the brain and its ability to support deeper, more restorative sleep. It works by activ...",
    "fullDescription": "Apigenin is a naturally occurring flavonoid found in chamomile and other plants, known for its calming effects on the brain and its ability to support deeper, more restorative sleep. It works by activating GABA receptors and reducing neuronal activity in the forebrain—helping to ease the mind and promote relaxation.Often used as part of a nighttime routine, Apigenin may also help lower cortisol levels and support antioxidant activity in the brain. It’s an effective, non-sedating option for improving sleep quality and managing daily stress.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, Falling Asleep, hidden, Huberman, label:new, Momentous, new, Shop All, sleep, Staying Asleep + Sleep Quality, Supplements, Travel + Shift Work",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "L-Theanine",
    "price": "$0.40",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_L-Theanine-Bottle_2000x2000_02142025.png?v=1739914167",
    "link": "https://www.livemomentous.com/products/l-theanine",
    "description": "L-Theanine is a naturally occurring amino acid found in tea leaves that promotes calm, focused mental states without causing drowsiness. It works by increasing alpha brain wave activity and supporting...",
    "fullDescription": "L-Theanine is a naturally occurring amino acid found in tea leaves that promotes calm, focused mental states without causing drowsiness. It works by increasing alpha brain wave activity and supporting neurotransmitters like GABA and serotonin—helping you stay relaxed yet alert.Often used to reduce acute stress, improve focus, and support the transition into restful sleep, L-Theanine is a safe, non-sedating option for managing mental performance and emotional balance throughout the day.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, Falling Asleep, Huberman, label:new, Momentous, new, quality sleep, Shop All, sleep, Staying Asleep + Sleep Quality, Supplements, Travel + Shift Work",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Alpha GPC",
    "price": "$0.45",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Alpha-GPC-Bottle_2000x2000_02142025-CC.png?v=1739910549",
    "link": "https://www.livemomentous.com/products/alpha-gpc",
    "description": "Alpha GPC is a highly bioavailable form of choline that supports cognitive performance, focus, and long-term brain health. It quickly crosses the blood-brain barrier to increase acetylcholine levels—a...",
    "fullDescription": "Alpha GPC is a highly bioavailable form of choline that supports cognitive performance, focus, and long-term brain health. It quickly crosses the blood-brain barrier to increase acetylcholine levels—a key neurotransmitter involved in memory, attention, and learning.Ideal for athletes, students, and professionals, Alpha GPC helps sharpen mental clarity, enhance neural communication, and may reduce cognitive decline over time. It’s a powerful tool for anyone looking to support brain performance and function at their peak.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, cognitive function, cognitive performance, energy + focus, Focus + Performance, Huberman, label:new, Momentous, new, Shop All, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Complete Sleep Stack",
    "price": "$1.89",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/Complete-Sleep-Stack_2000x2000_FEB212025_CC_1.png?v=1742235858",
    "link": "https://www.livemomentous.com/products/huberman-sleep-stack",
    "description": "The Complete Sleep Stack combines four research-backed ingredients—Magnesium L-Threonate, Apigenin, Inositol, and L-Theanine—to promote deep, uninterrupted sleep and next-day clarity. Designed to work...",
    "fullDescription": "The Complete Sleep Stack combines four research-backed ingredients—Magnesium L-Threonate, Apigenin, Inositol, and L-Theanine—to promote deep, uninterrupted sleep and next-day clarity. Designed to work synergistically, these ingredients calm the nervous system, regulate neurotransmitters, and help ease the mind into a restorative sleep cycle.Magnesium L-Threonate enhances cognitive recovery, Apigenin and L-Theanine promote relaxation and stress reduction, and Inositol helps regulate mood and nighttime wakeups. This non-melatonin sleep solution is ideal for those seeking consistent, high-quality rest without next-day grogginess.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, Bundles, Falling Asleep, Huberman, quality sleep, Shop All, sleep, stay asleep, Staying Asleep + Sleep Quality",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Rhodiola Rosea",
    "price": "$0.20",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Rhodiola-Bottle_2000x2000_02142025-CC.png?v=1739922761",
    "link": "https://www.livemomentous.com/products/rhodiola-rosea-extract",
    "description": "Rhodiola Rosea is a natural adaptogen known for its ability to help the body manage physical and mental stress. Sourced from high-altitude environments, this powerful botanical has been shown to impro...",
    "fullDescription": "Rhodiola Rosea is a natural adaptogen known for its ability to help the body manage physical and mental stress. Sourced from high-altitude environments, this powerful botanical has been shown to improve focus, reduce fatigue, and enhance endurance by supporting the body’s stress response systems.Ideal for athletes, professionals, and anyone under high cognitive or physical load, Rhodiola helps sustain energy levels, improve resilience, and sharpen mental performance—especially during intense or demanding periods.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, athletic performance, cognitive health, cognitive performance, hormone support, Huberman, Recovery, Stress Management, stress reduction, Supplements, Sustained Performance",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Vital Aminos",
    "price": "$0.46",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Vital-Aminos-Fruit-Punch_2000x2000_FEB142025_CC.png?v=1739921622",
    "link": "https://www.livemomentous.com/products/vital-amino",
    "description": "Vital Aminos is a blend of all nine essential amino acids (EAAs) plus four additional aminos that support muscle protein synthesis, recovery, and endurance. Amino acids are the building blocks of musc...",
    "fullDescription": "Vital Aminos is a blend of all nine essential amino acids (EAAs) plus four additional aminos that support muscle protein synthesis, recovery, and endurance. Amino acids are the building blocks of muscle, enzymes, hormones, and neurotransmitters—making them critical for both physical performance and overall metabolic health.This formula is ideal for athletes and active individuals looking to enhance muscle repair, reduce soreness, and improve training outcomes. Whether used pre-, intra-, or post-workout, Vital Aminos delivers the support your body needs to perform, recover, and rebuild.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "athletic performance, green-badge:new, Muscle Development, protein, recover faster, Recovery, Shop All, sports nutrition, strength",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Zinc",
    "price": "$0.19",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Zinc-Bottle_2000x2000_02142025-CC.png?v=1739922299",
    "link": "https://www.livemomentous.com/products/zinc-picolinate",
    "description": "Zinc is an essential trace mineral that plays a key role in immune function, cellular repair, and metabolic health. This highly bioavailable form of Zinc supports the body’s ability to defend against ...",
    "fullDescription": "Zinc is an essential trace mineral that plays a key role in immune function, cellular repair, and metabolic health. This highly bioavailable form of Zinc supports the body’s ability to defend against illness, repair tissues, and regulate hormone function—making it a vital daily supplement for active individuals.In addition to strengthening immune defenses, Zinc aids in wound healing, skin health, and enzyme activity across hundreds of bodily processes. It’s especially important for athletes, as intensive training can increase Zinc demand and depletion through sweat.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, foundational health, Hormone Metabolism, hormone support, Huberman, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Recovery",
    "price": "$0.55",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V2_Chocolate-Recovery-Jar_2000x2000_FEB142025_CC.png?v=1739915108",
    "link": "https://www.livemomentous.com/products/recovery-grass-fed-whey-isolate",
    "description": " \nMomentous Recovery is a performance-focused post-workout formula designed to optimize muscle repair, replenish glycogen stores, and reduce exercise-induced soreness. Featuring a clinically supported...",
    "fullDescription": " \nMomentous Recovery is a performance-focused post-workout formula designed to optimize muscle repair, replenish glycogen stores, and reduce exercise-induced soreness. Featuring a clinically supported 2:1 ratio of fast-acting carbohydrates to grass-fed whey protein, plus amino acids and electrolytes, it delivers comprehensive recovery support in one simple shake.Ideal for endurance athletes, strength trainers, and anyone serious about recovery, this formula helps your body rebuild and rehydrate efficiently—so you can train consistently and perform at your best.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, athletic performance, Momentous, Muscle Development, muscle growth, protein, recover faster, Recovery, sports nutrition, strength, Subscribe & Save",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Magnesium Malate",
    "price": "$0.18",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V1_Magnesium-Malate-Bottle_2000x2000_02142025-CC.png?v=1739914381",
    "link": "https://www.livemomentous.com/products/magnesium-malate-1",
    "description": "Magnesium Malate is a highly bioavailable form of magnesium that supports energy production, muscle recovery, and overall metabolic health. As a cofactor in over 600 enzymatic reactions, magnesium is ...",
    "fullDescription": "Magnesium Malate is a highly bioavailable form of magnesium that supports energy production, muscle recovery, and overall metabolic health. As a cofactor in over 600 enzymatic reactions, magnesium is essential for everything from ATP synthesis to nerve transmission and muscle relaxation.This form, bound to malic acid, is particularly effective for enhancing stamina, easing post-workout soreness, and supporting cardiovascular and neuromuscular function. Ideal for daily use, it helps keep your body functioning at its peak under stress or heavy training.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, athletic performance, Bone + Joint Health, joint health, Muscle Development, Recovery, Supplements, Sustained Performance",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Turmeric",
    "price": "$0.38",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Tumeric_CC.png?v=1739921017",
    "link": "https://www.livemomentous.com/products/turmeric-ultra",
    "description": "Turmeric is a powerful plant-based supplement rich in curcuminoids—natural compounds known for their strong anti-inflammatory and antioxidant effects. Used for centuries in traditional medicine, Turme...",
    "fullDescription": "Turmeric is a powerful plant-based supplement rich in curcuminoids—natural compounds known for their strong anti-inflammatory and antioxidant effects. Used for centuries in traditional medicine, Turmeric supports joint health, muscle recovery, and a balanced inflammatory response, especially after intense physical activity.Ideal for athletes and active individuals, Turmeric helps reduce soreness and support long-term joint integrity. Its systemic benefits also extend to heart, brain, and immune health, making it a daily staple for those seeking both performance and protection.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, Amp Human, Daily Essentials, foundational health, inflammation, Joint and Bone Strength, marketing samples, Momentous, Supplements, Wholesale Store",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Collagen + Creatine Stack",
    "price": "$0.76",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/Collagen-Creatine-30-Stack_2000x2000_02212025-CC_1.png?v=1742235058",
    "link": "https://www.livemomentous.com/products/collagen-creatine",
    "description": "\n\n\nThe Collagen + Creatine Stack combines two of the most researched supplements for performance and recovery—working together to support strong muscles, durable joints, and connective tissue resilien...",
    "fullDescription": "\n\n\nThe Collagen + Creatine Stack combines two of the most researched supplements for performance and recovery—working together to support strong muscles, durable joints, and connective tissue resilience. This stack includes 10g of Collagen Peptides and 5g of Creatine Monohydrate, ideal for athletes, active individuals, or anyone focused on aging well and moving pain-free.Creatine fuels muscle energy and performance while supporting cognitive function. Collagen aids in the repair and maintenance of tendons, ligaments, and skin. Taken daily, this pairing supports total body strength and structural integrity from the inside out.\n",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "athletic performance, Bundles",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Ashwagandha",
    "price": "$0.25",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V2_Ashwagandha-Bottle_2000x2000_02142025.png?v=1739910970",
    "link": "https://www.livemomentous.com/products/ashwagandha",
    "description": "Momentous Ashwagandha features NooGandha®—a highly concentrated, clinically studied extract designed to support stress management, focus, and cognitive performance. Unlike traditional ashwagandha, Noo...",
    "fullDescription": "Momentous Ashwagandha features NooGandha®—a highly concentrated, clinically studied extract designed to support stress management, focus, and cognitive performance. Unlike traditional ashwagandha, NooGandha® promotes calm alertness without sedation, making it ideal for high-performing individuals who need to stay clear-headed under pressure.This adaptogen helps balance cortisol levels, improve emotional resilience, and support mental clarity, making it a smart addition for anyone managing stress, training demands, or cognitive fatigue.\n \n",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Acetyl L-Carnitine",
    "price": "$0.27",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Acetyl-L-Carnitine-Bottle_2000x2000_02142025-CC.png?v=1739910356",
    "link": "https://www.livemomentous.com/products/acetyl-l-carnitine",
    "description": "Acetyl L-Carnitine is a naturally occurring amino acid derivative that supports cognitive function, energy metabolism, and cellular health. It plays a key role in transporting fatty acids into the mit...",
    "fullDescription": "Acetyl L-Carnitine is a naturally occurring amino acid derivative that supports cognitive function, energy metabolism, and cellular health. It plays a key role in transporting fatty acids into the mitochondria—where they're converted into usable energy—making it especially valuable for brain and nerve cells with high energy demands.This compound also acts as a potent antioxidant, helping protect the brain from oxidative stress while supporting focus, memory, and mental clarity. It’s ideal for individuals looking to boost cognitive performance, mood, and mitochondrial function.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "60 Day Cycle, cognitive function, foundational health, Huberman, label:new, Metabolism, Momentous, new, Shop All, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "Brain Drive",
    "price": "$0.45",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Brain-Drive-Bottle_2000x2000_02142025.png?v=1739911197",
    "link": "https://www.livemomentous.com/products/brain-drive",
    "description": " \nBrain Drive is a daily nootropic formula designed to enhance mental clarity, motivation, and long-term brain health. It combines Acetyl L-Carnitine, Bacopa Monnieri, Tyrosine, and B vitamins—ingredi...",
    "fullDescription": " \nBrain Drive is a daily nootropic formula designed to enhance mental clarity, motivation, and long-term brain health. It combines Acetyl L-Carnitine, Bacopa Monnieri, Tyrosine, and B vitamins—ingredients that support neurotransmitter production, blood flow, and cognitive resilience under stress.Ideal for athletes, professionals, and high performers, Brain Drive helps you stay sharp, focused, and mentally energized throughout the day. Whether you're training, working, or problem-solving, it’s a powerful tool for unlocking sustained mental performance.",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, cognitive function, cognitive health, Daily Essentials, energy + focus, Focus + Performance, Momentous, Subscribe & Save, Supplements",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  },
  {
    "title": "100% Plant Protein Powder",
    "price": "$0.50",
    "image": "https://cdn.shopify.com/s/files/1/1400/2351/files/V3_Chocolate-Plant-Protein_Plant-Protein_Jar_2000x2000_FEB142025_CC.png?v=1740008868",
    "link": "https://www.livemomentous.com/products/100-plant-protein-powder",
    "description": "Momentous 100% Plant Protein delivers 20g of complete, plant-based protein sourced from pea and rice—providing a full amino acid profile to support muscle repair, recovery, and daily performance. Sour...",
    "fullDescription": "Momentous 100% Plant Protein delivers 20g of complete, plant-based protein sourced from pea and rice—providing a full amino acid profile to support muscle repair, recovery, and daily performance. Sourced exclusively from the U.S. and Canada, this formula is smooth, easy to mix, and free from artificial ingredients, gums, or fillers.NSF Certified for Sport®, it’s trusted by elite athletes and everyday performers alike. Whether post-workout or as a daily nutrition boost, this protein supports strength, satiety, and clean fuel for your goals.\n ",
    "category": "Product",
    "availability": "Check Availability",
    "tags": "30 Day Cycle, athletic performance, Huberman, label: New Container, Momentous, Muscle Development, Muscle Growth, protein, recover faster, Recovery, sports nutrition, strength, Subscribe & Save",
    "scraped_at": "2025-09-11T13:45:11.107Z"
  }
]